Tekla Open API Reference for Tekla Structures 2025
NumberingSeries Constructor (String, Int32)
 Instantiates a numbering series with the given arguments.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumberingSeries(
	string Prefix,
	int Number
)
Public Sub New (
	Prefix As String,
	Number As Integer
)
Parameters
Prefix
Type: System.String
The prefix to be used.
Number
Type: System.Int32
The start number to be used.
See Also
Reference
NumberingSeries Class
NumberingSeries Overload
Tekla.Structures.Model Namespace